7zip
a52dec
aalib
abseil-cpp
acl
ada
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-oss
alsa-plugins
alsa-tools
alsa-topology-conf
alsa-ucm-conf
alsa-utils
android-tools
android-udev
aom
appstream
apr
apr-util
arch-install-scripts
arch-update
archiso
archlinux-contrib
archlinux-keyring
arj
at-spi2-core
attr
audit
autoconf
automake
avahi
avisynthplus
ayatana-ido
base
base-devel
bash
bash-completion
betterbird-bin
binutils
bison
bitwarden
bitwig-studio
blas
blueman
bluez
bluez-libs
bluez-utils
boost-libs
bottles
breeze-icons
bridge-utils
brotli
btop
btrfs-assistant
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cabextract
cairo
cairomm
cairomm-1.16
cblas
cdparanoia
chromaprint
cifs-utils
circle-flags
clang
clang21
cmus
coin
colord-gtk
colord-gtk-common
compiler-rt
compiler-rt21
confuse
conky
coreutils
cpio
cracklib
cryptsetup
cuda
curl
darktable
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
dcraw
debugedit
default-cursors
deno
desktop-file-utils
device-mapper
devil
diffutils
dkms
dmenu
dosfstools
double-conversion
duktape
dunst
e2fsprogs
edk2-ovmf
egl-gbm
egl-wayland
egl-x11
eglexternalplatform
electron36
electron37
electron38
electron41
enchant
erofs-utils
exiv2
expat
faac
faad2
fakeroot
faugus-launcher
ffmpeg
ffmpeg4.4
fftw
file
filesystem
findutils
firefox
firewall-applet
firewall-config
firewalld
flac
flex
flickcurl
fluidsynth
fmt
fontconfig
freecad
freeglut
freetype2
fribidi
fuse-common
fuse2
fuse3
fvs2
gamemode
gawk
gc
gcc
gcc-libs
gconf
gcr
gcr-4
gd
gdbm
gdk-pixbuf2
gettext
ghostscript
giflib
git
github-cli
github-desktop
gksu
glew
glib-networking
glib2
glib2-devel
glibc
glibmm
glibmm-2.68
glrnvim
glslang
glu
glycin
gmic
gmp
gmtp
gnome-keyring
gnu-free-fonts
gnulib-l10n
gnupg
gnuplot
gnutls
go
gobject-introspection-runtime
gopls
gperftools
gpgme
gpgmepp
gpm
graphene
graphicsmagick
graphite
grep
groff
grub
grub-btrfs
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gspell
gssdp
gst-plugin-gtk4
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gstreamer
gtest
gtk-update-icon-cache
gtk2
gtk3
gtk4
gtkmm-4.0
gtksourceview3
gtksourceview5
guile
gupnp
gupnp-igd
gvfs
gzip
harfbuzz
harfbuzz-icu
hdf5
hicolor-icon-theme
hidapi
highway
htmlq
hub
hunspell
hwdata
hwloc
hyphen
hypnotix
i3-wm
i3blocks
i3lock
i3status
iana-etc
icoextract
icu
ijs
imagemagick
imath
imlib2
intel-gmmlib
intel-media-driver
intel-media-sdk
intel-ucode
inxi
iproute2
iptables
iputils
iso-codes
jansson
jasper
java-environment-common
java-runtime-common
jbig2dec
jbigkit
jdk-openjdk
jdk11-openjdk
jgmenu
json-c
json-glib
jsoncpp
karchive
kbd
kbookmarks
kcodecs
kcolorscheme
kcompletion
kconfig
kcontacts
kcoreaddons
kcrash
kdbusaddons
kdeclarative
kdeconnect
keyutils
kglobalaccel
kguiaddons
ki18n
kiconthemes
kio
kirigami
kirigami-addons
kitemmodels
kitemviews
kjobwidgets
kmod
knotifications
kpeople
krb5
kservice
kstatusnotifieritem
ksvg
kwallet
kwidgetsaddons
kwindowsystem
l-smash
ladspa
lame
lapack
lcms2
ldb
leancrypto
lensfun
less
lhasa
lib32-alsa-lib
lib32-alsa-plugins
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-glib2
lib32-glibc
lib32-gmp
lib32-gnutls
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libngtcp2
lib32-libnm
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libunistring
lib32-libva
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxinerama
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nettle
lib32-nspr
lib32-nss
lib32-nvidia-580xx-utils
lib32-opencl-nvidia-580xx
lib32-openssl
lib32-p11-kit
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libadwaita
libaec
libaio
libao
libappindicator
libarchive
libasan
libass
libassuan
libasyncns
libatasmart
libatomic
libavc1394
libavif
libavtp
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-smart
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libburn
libbytesize
libc++
libc++abi
libcaca
libcacard
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcerf
libcloudproviders
libcolord
libconfig
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libdca
libde265
libdecor
libdeflate
libdiscid
libdispatch
libdisplay-info
libdovi
libdrm
libdv
libdvdnav
libdvdread
libebur128
libedit
libei
libelf
libepoxy
libev
libevdev
libevent
libexif
libfabric
libfakekey
libfdk-aac
libffi
libfm
libfm-extra
libfm-gtk3
libfontenc
libfreeaptx
libfyaml
libgcc
libgcrypt
libgfortran
libgirepository
libgit2
libgksu
libglvnd
libgme
libgnome-keyring
libgnomekbd
libgomp
libgpg-error
libgphoto2
libgtop
libgudev
libhandy
libheif
libice
libid3tag
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libisoburn
libisofs
libjpeg-turbo
libjxl
libksba
liblc3
libldac
libldap
liblqr
liblrdf
liblsan
libltc
libluv
libmad
libmakepkg-dropins
libmanette
libmbim
libmd
libmfx
libmicrodns
libmm-glib
libmng
libmnl
libmodplug
libmp4v2
libmpc
libmpcdec
libmspack
libmtp
libmysofa
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnss_nis
libnvme
libobjc
libogg
libopenmpt
libp11-kit
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libpng12
libportal
libportal-gtk4
libproxy
libpsl
libptytty
libpulse
libpwquality
libqalculate
libqmi
libqrtr-glib
libquadmath
libraqm
libraw1394
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsigc++
libsigc++-3.0
libsixel
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspnav
libsrtp
libssh
libssh2
libstdc++
libstemmer
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtirpc
libtool
libtorrent-rasterbar
libtsan
libubsan
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libutf8proc
libuv
libva
libvdpau
libverto
libvlc
libvorbis
libvpl
libvpx
libvterm
libwacom
libwbclient
libwebp
libwireplumber
libwmf
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmp
libxmu
libxnvctrl-580xx
libxpm
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libyuv
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
linux-headers
lld
llhttp
llvm
llvm-libs
llvm21
llvm21-libs
lm_sensors
lmdb
localsend
lrzip
lsb-release
lsof
lua
lua51-lpeg
lua54
luajit
lv2
lvm2
lxdm
lxmenu-data
lxsession
lz4
lzip
lzo
lzop
m4
mailcap
make
man-db
md4c
mdadm
med
media-player-info
menu-cache
mesa
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mpdecimal
mpfr
mpg123
mpv
msgpack-c
mtdev
mtools
mtpfs
mujs
ncdu
ncurses
neon
neovim
nettle
network-manager-applet
networkmanager
nftables
ninja
nm-connection-editor
nodejs
npth
nspr
nss
numactl
nvidia-580xx-dkms
nvidia-580xx-settings
nvidia-580xx-utils
nvim-ghost-git
nvim-yarp-git
ocl-icd
onetbb
openal
opencascade
opencl-nvidia-580xx
opencore-amr
opencv
opencv-samples
openexr
openh264
openjpeg2
openjph
openmp
openmpi
openpmix
openssh
openssl
openucx
openxr
opus
opusfile
orc
osm-gps-map
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pango
pangomm-2.48
parted
pasystray
patch
patchelf
patool
pavucontrol
pciutils
pcmanfm
pcre
pcre2
pcsclite
perl
perl-class-inspector
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-file-sharedir
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-image-exiftool
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
phantomjs
picom
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pipewire-session-manager
pixman
pkgconf
playerctl
polkit
polkit-gnome
poppler-data
popt
portaudio
portmidi
ppp
procps-ng
protobuf
prrte
psmisc
pugixml
pulseaudio-alsa
pulseaudio-control
pulseaudio-qt
pyalpm
pybind11
pyside6
python
python-annotated-doc
python-annotated-types
python-anyio
python-argcomplete
python-asgiref
python-asttokens
python-async-timeout
python-attrs
python-audioop-lts
python-autocommand
python-bandcamp-api
python-beautifulsoup4
python-black
python-build
python-cairo
python-capng
python-certifi
python-cffi
python-chardet
python-charset-normalizer
python-cinemagoer
python-click
python-contourpy
python-cryptography
python-cssselect
python-cycler
python-dateutil
python-dbus
python-defusedxml
python-demjson3
python-dirty-equals
python-distro
python-dotenv
python-dunamai
python-editables
python-execnet
python-executing
python-fastapi
python-filelock
python-firewall
python-fonttools
python-fvs
python-gobject
python-greenlet
python-h11
python-h2
python-hatchling
python-hpack
python-html5lib
python-httpcore
python-httptools
python-httpx
python-hyperframe
python-idna
python-importlib-metadata
python-inflect
python-iniconfig
python-installer
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jinja
python-jiter
python-jsonschema
python-jsonschema-specifications
python-kiwisolver
python-lxml
python-lxml-html-clean
python-markdown
python-markdown-it-py
python-markupsafe
python-matplotlib
python-mdurl
python-more-itertools
python-msgpack
python-mypy_extensions
python-numpy
python-orjson
python-outcome
python-packaging
python-pathspec
python-pathvalidate
python-pdm-backend
python-pefile
python-pillow
python-pip
python-pivy
python-pkg_resources
python-platformdirs
python-pluggy
python-ply
python-portend
python-psutil
python-pyaudio
python-pycparser
python-pycurl
python-pydantic
python-pydantic-core
python-pydantic-extra-types
python-pydantic-settings
python-pygame
python-pygments
python-pynvim
python-pyparsing
python-pyproject-hooks
python-pyproject-metadata
python-pyqt6
python-pyqt6-sip
python-pyqt6-webengine
python-pytest
python-pytest-asyncio
python-python-multipart
python-pytokens
python-pytz
python-referencing
python-regex
python-requests
python-requests-file
python-rich
python-rpds-py
python-ruff
python-setproctitle
python-setuptools
python-setuptools-scm
python-sgmllib3k
python-shellingham
python-six
python-sniffio
python-sortedcontainers
python-soupsieve
python-speechrecognition
python-sqlalchemy
python-starlette
python-steamgriddb
python-tempora
python-tomli-w
python-tomlkit
python-tqdm
python-trio
python-trove-classifiers
python-typeguard
python-typing-inspection
python-typing_extensions
python-unidecode
python-urllib3
python-uvloop
python-vcs-versioning
python-vdf
python-webencodings
python-websockets
python-wheel
python-yaml
python-yara
python-zipp
python2
qalculate-gtk
qbittorrent
qca-qt6
qhull
qqc2-desktop-style
qrencode
qt5-base
qt5-declarative
qt5-gamepad
qt5-graphicaleffects
qt5-imageformats
qt5-multimedia
qt5-networkauth
qt5-quickcontrols
qt5-quickcontrols2
qt5-remoteobjects
qt5-script
qt5-sensors
qt5-serialport
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-virtualkeyboard
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-websockets
qt5-x11extras
qt5-xmlpatterns
qt6-3d
qt6-5compat
qt6-base
qt6-charts
qt6-connectivity
qt6-datavis3d
qt6-declarative
qt6-doc
qt6-examples
qt6-graphs
qt6-grpc
qt6-httpserver
qt6-imageformats
qt6-languageserver
qt6-location
qt6-lottie
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-networkauth
qt6-positioning
qt6-quick3d
qt6-quick3dphysics
qt6-quickeffectmaker
qt6-quicktimeline
qt6-remoteobjects
qt6-scxml
qt6-sensors
qt6-serialbus
qt6-serialport
qt6-shadertools
qt6-speech
qt6-svg
qt6-tools
qt6-translations
qt6-virtualkeyboard
qt6-wayland
qt6-webchannel
qt6-webengine
qt6-websockets
qt6-webview
ranger
raptor
rav1e
re2
readline
rnnoise
rtkit
rtmpdump
rubberband
ruff
rust
rust-analyzer
rust-src
rxvt-unicode
rxvt-unicode-terminfo
samba
sbc
scrcpy
sdl2-compat
sdl2_image
sdl2_mixer
sdl2_ttf
sdl3
seahorse
sed
serd
shaderc
shadow
shared-mime-info
shiboken6
simdjson
simple-mtpfs
slang
smbclient
snapper
snappy
sndio
solid
sonnet
soqt
sord
sound-theme-freedesktop
soundtouch
spandsp
speedtest++
speex
speexdsp
spice
spice-protocol
spirv-tools
spotube-bin
sqlite
squashfs-tools
sratom
srt
startup-notification
steam
steam-devices
sudo
svt-av1
svt-hevc
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tcl
tdb
telegram-desktop
tevent
texinfo
thin-provisioning-tools
tinysparql
tk
tpm2-tss
trash-cli
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-hack
twolame
tzdata
uchardet
udisks2
unarj
unibilium
unrar
unzip
upower
urxvt-perls
usbutils
util-linux
util-linux-libs
uvicorn
v4l-utils
vapoursynth
verdict
vid.stab
vim
vim-coc-clangd-git
vim-coc-css-git
vim-coc-deno-git
vim-coc-diagnostic-git
vim-coc-dictionary-git
vim-coc-emoji-git
vim-coc-eslint-git
vim-coc-explorer-git
vim-coc-git
vim-coc-git-git
vim-coc-go-git
vim-coc-highlight-git
vim-coc-html-git
vim-coc-htmlhint-git
vim-coc-java-git
vim-coc-json-git
vim-coc-lists-git
vim-coc-marketplace-git
vim-coc-pairs-git
vim-coc-pyright-git
vim-coc-rust-analyzer-git
vim-coc-sh-git
vim-coc-snippets-git
vim-coc-syntax-git
vim-coc-tabnine-git
vim-coc-tag-git
vim-coc-tsserver-git
vim-coc-vetur-git
vim-coc-vimlsp-git
vim-coc-word-git
vim-coc-yaml-git
vim-coc-zsh-git
vim-runtime
vkbasalt-cli
vlc
vlc-cli
vlc-gui-qt
vlc-plugin-a52dec
vlc-plugin-alsa
vlc-plugin-archive
vlc-plugin-dav1d
vlc-plugin-dbus
vlc-plugin-dbus-screensaver
vlc-plugin-faad2
vlc-plugin-flac
vlc-plugin-gnutls
vlc-plugin-inflate
vlc-plugin-journal
vlc-plugin-jpeg
vlc-plugin-lua
vlc-plugin-mpg123
vlc-plugin-ogg
vlc-plugin-opus
vlc-plugin-png
vlc-plugin-pulse
vlc-plugin-shout
vlc-plugin-speex
vlc-plugin-tag
vlc-plugin-theora
vlc-plugin-twolame
vlc-plugin-vorbis
vlc-plugin-vpx
vlc-plugin-xml
vlc-plugins-base
vlc-plugins-video-output
vmaf
volume_key
vte-common
vtk
vulkan-icd-loader
warp
warp-terminal
waveterm
wavpack
wayland
webkit2gtk
webkit2gtk-4.1
webkitgtk-6.0
webrtc-audio-processing-1
which
wildmidi
wireless_tools
wireplumber
woff2
words
wpa_supplicant
wxwidgets-common
wxwidgets-gtk3
x264
x265
xapp
xapp-symbolic-icons
xarchiver
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-user-dirs
xdg-utils
xerces-c
xf86-input-evdev
xf86-input-libinput
xf86-input-synaptics
xf86-input-vmmouse
xf86-input-void
xf86-video-amdgpu
xf86-video-ati
xf86-video-dummy
xf86-video-fbdev
xf86-video-intel
xf86-video-nouveau
xf86-video-qxl
xf86-video-vesa
xf86-video-voodoo
xkeyboard-config
xmlsec
xorg-bdftopcf
xorg-font-util
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbprint
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xorgproto
xsel
xsettings-client
xsettingsd
xvidcore
xxhash
xz
yad
yajl
yaml-cpp
yara
yay
yt-dlp
yt-dlp-ejs
zapzap
zbar
zenity
zeromq
zimg
zint
zip
zix
zlib
zlib-ng
zoom
zram-generator
zramswap
zsh
zstd
zulucrypt
zvbi
zxing-cpp
