awesome-terminal-fonts
android-tools
font-mathematica
gvfs
gvfs-afc
gvfs-smb
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
opendesktop-fonts
powerline-fonts
ranger
atool
elinks
ffmpegthumbnailer
highlight
mediainfo
odt2txt
perl-image-exiftool
poppler
python-chardet
w3m
terminus-font
ttf-anonymous-pro
ttf-dejavu
ttf-roboto
ttf-hack
i3-gaps
i3lock
i3status 
scrot
maim
bluez
alsa-firmware
alsa-tools
alsa-utils
pcmanfm 
pulseaudio-alsa
pulseaudio-bluetooth
pulseeffects 
calf
lsp-plugins
mda.lv2
rubberband 
zam-plugins
lmms
libsamplerate 
libsndfile
zita-convolver
libebur128 
blueberry 
network-manager-applet
baobab
conky
clamav
ntp
acpi
rxvt-unicode
urxvt-perls
dosfstools
ntfs-3g
exfat-utils
parted
gparted
leafpad
python3
chntpw
arch-install-scripts
archiso
bash-completion
ffmpeg
flashplugin
hddtemp
imagemagick
memtest86+
sbxkb
speedtest-cli
udiskie
ufw
gufw 
ufw-extras
vlc
youtube-dl
yay
xdotool
xf86-input-synaptics 
xorg 
xorg-server
xorg-xinit
xorg-drivers
qemu
qemu-arch-extra
qemu-block-gluster
qemu-block-iscsi
qemu-block-rbd
fzf
